# ICIJ Data Exploration by SQL

he ICIJ Offshore Database shows relationships and networks among people or companies and offshore entities. Consider this database like a corporate registry where you can check information about a company and the people who played a role in that entity at a certain point in time. Roles include being a director, a shareholder, a beneficial owner, a trustee, among others.

In [1]:
import sqlite3
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import datetime as dt
from IPython.display import display
import os
import glob
import sys

## These first steps are creating a datebase called OffShoreLeaks

### If interested in only interacting with the database and not the creation of the database scroll down

## The tables in the database are the 4 csv files that were downloaded

In [2]:
# Before loading the data into a pandas dataframe, I cleaned the data up somewhat in excel by
#  formating the columns using "Text-to-Columns", they were separated by a semicolumn and I had
#  trouble getting the files to load at first. I also had to use this encoding='utf-8', to properly
#  load the data.


countriesNW = pd.read_csv("countriesNWCleaned.csv",encoding='utf-8')

In [3]:
countriesNW.head()

   country_id country_code    country_name
0           1           AF     Afghanistan
1           2           AX        Akrotiri
2           3           AL         Albania
3           4           AG         Algeria
4           5           AQ  American Samoa

In [4]:
# Connect to the database I created in SQLite called OffShoreLeaks
conn = sqlite3.connect("OffshoreLeaks.db")

In [5]:
type(countriesNW)

pandas.core.frame.DataFrame

In [66]:
# Found this code before using encoding='utf-8' which spot check which data files was giving me the most 
#  trouble. Data values with special characters was giving me the most trouble. Note: It seems encoding='utf-8']
#   might have alleviated some of those issues, however, with the first csv file I loaded I did change two
#   of the cities characters which were giving me trouble.


faulty_rows = []
for i in range(len(countriesNW)):
    try:
        test = countriesNW.iloc[i]
        test.to_csv("test.csv")
    except:
        pass
        faulty_rows.append(i)
        print i

In [69]:
countriesNW.iloc[60,]

country_id                 61
country_code               IV
country_name    CA te dIvoire
Name: 60, dtype: object

In [70]:
countriesNW.columns = ['country_id','country_code','country_name']

In [27]:
disk_engine = create_engine('sqlite:OffshoreLeaks.db') # Initializes database  directory
disk_engine.text_factory = str

In [80]:
countriesNW.to_sql('countriesNW', disk_engine, if_exists='append')

In [81]:
# This method did not work in this case

#conn.text_factory = str  # allows utf-8 data to be stored
#countriesNW.to_sql(countriesNW, conn,if_exists='append',index=False,encoding='utf-8')

The method below did not work, however, because of time I chose not to figure it out since the above method 
works

In [23]:
#con = sqlite3.connect(":memory:")
#cur = con.cursor()
#cur.execute("CREATE TABLE t (col1, col2, col3);")

In [24]:
#with open("C:/Users/James/Desktop/python_training/DataChallenge/OffshoreLeaks/countriesNWCleaned.csv",'rb') as fin:
#    dr = csv.DictReader(fin) # comma is default delimiter
#    to_db = [(i['country_id'], i['country_code'], i['country_name']) for i in dr]

In [82]:
#cur.executemany("INSERT INTO t (col1, col2, col3) VALUES (?, ?, ?);", to_db)
#con.commit()

In [29]:
#db = sys.argv[1]
 
#conn = sqlite3.connect(db)
#conn.text_factory = str  # allows utf-8 data to be stored
 
#c = conn.cursor()

In [3]:
# Next csv file

# WARNING: Deleted ChinesePos column which had a lot of special characters. Challenge to upload file. Once
#   column was deleted I was able to load the dataframe up.

edgesNW = pd.read_csv("edges_1DNWCleaned.csv")

c:\Users\James\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:2868: DtypeWarning: Columns (4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
edgesNW.head(5)

,Unique_ID,Entity_ID1,Entity_ID2,description_,date_from,date_to,direction,linkType
0,171253,102767,124901,Assistant Secretary,NaN,NaN,1,EO
1,336222,118470,167808,Auditor,NaN,NaN,1,EO
2,336223,48124,167808,Auditor,NaN,NaN,1,EO
3,336224,61547,167808,Auditor,NaN,NaN,1,EO
4,336256,89570,123436,Authorised Person / Signatory,NaN,NaN,1,EO

In [10]:
edgesNW.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 562015 entries, 0 to 562014
Data columns (total 8 columns):
Unique_ID       562015 non-null int64
Entity_ID1      562015 non-null int64
Entity_ID2      562015 non-null int64
description_    562015 non-null object
date_from       230271 non-null object
date_to         30108 non-null object
direction       562015 non-null int64
linkType        562015 non-null object
dtypes: int64(4), object(4)
memory usage: 34.3+ MB

In [8]:
edgesNW.describe()

           Unique_ID    Entity_ID1    Entity_ID2      direction
count  562015.000000  5.620150e+05  5.620150e+05  562015.000000
mean   284943.688636  1.380513e+05  1.912398e+05       0.998893
std    165749.904636  1.880105e+05  4.932615e+04       0.033249
min         1.000000  1.000000e+00  4.151700e+04       0.000000
25%    140693.500000  5.466200e+04  1.483260e+05       1.000000
50%    284571.000000  9.177200e+04  1.753030e+05       1.000000
75%    428570.500000  1.943905e+05  2.367240e+05       1.000000
max    572896.000000  5.719300e+06  2.004267e+06       1.000000

In [ ]:
# This caused the system to crash this time, do not use on this file.

faulty_rows = []
for i in range(len(countriesNW)):
    try:
        test = countriesNW.iloc[i]
        test.to_csv("test.csv")
    except:
        pass
        faulty_rows.append(i)
        print i

In [38]:
disk_engine = create_engine('sqlite:OffshoreLeaks.db')

In [12]:
edgesNW.to_sql('edgesNW', disk_engine, if_exists='append')

In [39]:
node_countries = pd.read_csv("node_countriesNWCleaned.csv",encoding='utf-8')

In [40]:
node_countries.head(5)

   NODEID1 country_code country_name  country_id
0   118720           HK    Hong Kong       110.0
1   118722           HK    Hong Kong       110.0
2   118725           TW       Taiwan       241.0
3   118726           TW       Taiwan       241.0
4   118753           HK    Hong Kong       110.0

In [41]:
node_countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 326213 entries, 0 to 326212
Data columns (total 4 columns):
NODEID1         326213 non-null int64
country_code    326213 non-null object
country_name    326213 non-null object
country_id      275084 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 10.0+ MB

In [42]:
node_countries.count()

NODEID1         326213
country_code    326213
country_name    326213
country_id      275084
dtype: int64

In [43]:
# I had to add encoding='utf-8' into the pd.read_csv file in order for this to work.

node_countries.to_sql('node_countries', disk_engine, if_exists='append')

In [6]:
nodes = pd.read_csv("nodesNWCleaned.csv",encoding='utf-8')

c:\Users\James\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:2868: DtypeWarning: Columns (4,5,6,7,8,9,10,11,12,14,15,17,18,19,20,21,22) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [34]:
nodes.head(5)

,Unique_ID,subtypes_,Description_,searchField_,status,desc_status,type,desc_company_type,inc_dat,dorm_dat,...,agencyID,tax_stat,tax_stat_description,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
0,51113,OFFICER,Bisbro Investment Company Ltd.,Bisbro Investment Company Ltd.,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,51114,OFFICER,Mohamed Mustafa Bin A Mohamed Ismail,Mohamed Mustafa Bin A Mohamed Ismail,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,51115,OFFICER,Teh Hong Eng,Teh Hong Eng,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,51116,OFFICER,New Sights Enterprises Limited,New Sights Enterprises Limited,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,51117,OFFICER,Yong Meow Mui,Yong Meow Mui,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
nodes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279495 entries, 0 to 279494
Data columns (total 23 columns):
Unique_ID               279495 non-null object
subtypes_               278973 non-null object
Description_            278825 non-null object
searchField_            200957 non-null object
status                  23278 non-null object
desc_status             23254 non-null object
type                    30138 non-null object
desc_company_type       30042 non-null object
inc_dat                 22801 non-null object
dorm_dat                4723 non-null object
juris                   12202 non-null object
desc_jurisdiction       12160 non-null object
completeAddresses       13175 non-null object
agencyID                120362 non-null float64
tax_stat                30701 non-null object
tax_stat_description    30695 non-null object
Unnamed: 16             0 non-null float64
Unnamed: 17             106 non-null object
Unnamed: 18             106 non-null object
Unnamed: 19             13 non-null object
Unnamed: 20             13 non-null object
Unnamed: 21             1 non-null object
Unnamed: 22             1 non-null object
dtypes: float64(2), object(21)
memory usage: 49.0+ MB

In [36]:
nodes.count()

Unique_ID               279495
subtypes_               278973
Description_            278825
searchField_            200957
status                   23278
desc_status              23254
type                     30138
desc_company_type        30042
inc_dat                  22801
dorm_dat                  4723
juris                    12202
desc_jurisdiction        12160
completeAddresses        13175
agencyID                120362
tax_stat                 30701
tax_stat_description     30695
Unnamed: 16                  0
Unnamed: 17                106
Unnamed: 18                106
Unnamed: 19                 13
Unnamed: 20                 13
Unnamed: 21                  1
Unnamed: 22                  1
dtype: int64

In [ ]:
nodes.to_sql('nodes', disk_engine, if_exists='append')

# All the Data is now in a DataBase called OffShoreLeaks

### **WARNING**:
* IGNORE ALL ABOVE SINCE DATABASE WAS ALREADY CREATED
* However, the steps above demonstrate how to create a database from csv files.

In [1]:
import sqlite3
import pandas as pd

In [2]:
# Connect to the database I created in SQLite called OffShoreLeaks
conn = sqlite3.connect("OffshoreLeaks.db")

print "Opened database successfully";

Opened database successfully

In [3]:
# Set a function as a sql_to_pandas Exploration

def sql_to_df(sql_query):
    
    # Use pandas to pass sql query using connection from SQLite3
    df = pd.read_sql(sql_query, conn)
    
    # Show the resulting DataFrame
    return df

In [4]:
# Print out the table in the database

query = '''SELECT name 
FROM sqlite_master 
WHERE type = 'table';'''


## Look up sqlite_master

sql_to_df(query)

             name
0     countriesNW
1         edgesNW
2  node_countries
3           nodes

In [5]:
# Explore countries table

query = '''SELECT *
FROM countriesNW
LIMIT 2'''

sql_to_df(query)

   index  country_id country_code country_name
0      0           1           AF  Afghanistan
1      1           2           AX     Akrotiri

In [6]:
query = '''SELECT COUNT(country_name)
FROM countriesNW'''

sql_to_df(query)

   COUNT(country_name)
0                  276

In [7]:
# Count how many distinct countries there are

query = '''SELECT COUNT(Distinct(country_name))
FROM countriesNW'''

sql_to_df(query)

   COUNT(Distinct(country_name))
0                            275

In [8]:
# Explore nodes table

query = '''SELECT *
FROM nodes
LIMIT 2 '''

sql_to_df(query)

,index,Unique_ID,subtypes_,Description_,searchField_,status,desc_status,type,desc_company_type,inc_dat,...,agencyID,tax_stat,tax_stat_description,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
0,0,51113,OFFICER,Bisbro Investment Company Ltd.,Bisbro Investment Company Ltd.,None,None,None,None,None,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,51114,OFFICER,Mohamed Mustafa Bin A Mohamed Ismail,Mohamed Mustafa Bin A Mohamed Ismail,None,None,None,None,None,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
query = '''SELECT COUNT(subtypes_)
FROM nodes'''

sql_to_df(query)

   COUNT(subtypes_)
0            278973

In [12]:
def ensure_unicode(v):
    if isinstance(v, str):
        v = v.decode('utf8')
    return unicode(v)  # convert anything not a string to unicode too





query = '''SELECT COUNT(DISTINCT(Unique_ID)) AS ID
FROM nodes'''

sql_to_df(query)

       ID
0  278902

In [13]:
# Explore nodes table

query = '''SELECT *
FROM node_countries
LIMIT 2 '''

sql_to_df(query)

   index  NODEID1 country_code country_name  country_id
0      0   118720           HK    Hong Kong       110.0
1      1   118722           HK    Hong Kong       110.0

In [17]:
# Explore node_countries table

query = '''SELECT Count(Distinct(Country_name))
FROM node_countries
'''

sql_to_df(query)

   Count(Distinct(Country_name))
0                            174

In [18]:
# Explore edgesNW table

query = '''SELECT *
FROM edgesNW
LIMIT 2 '''

sql_to_df(query)

,index,Unique_ID,Entity_ID1,Entity_ID2,description_,date_from,date_to,direction,linkType
0,0,171253,102767,124901,Assistant Secretary,None,None,1,EO
1,1,336222,118470,167808,Auditor,None,None,1,EO

In [20]:
query = '''SELECT Count(Distinct(description_))
FROM edgesNW
'''

sql_to_df(query)

   Count(Distinct(description_))
0                             53

In [24]:
# Notice that node_counties has 174 unqiue Country names while contriesNW has 275 unique Country Names

query = '''SELECT Count(Distinct(Country_name))
FROM node_countries
'''

print(sql_to_df(query))

query = '''SELECT COUNT(Distinct(Country_name))
FROM countriesNW'''

print(sql_to_df(query))

   Count(Distinct(Country_name))
0                            174
   COUNT(Distinct(Country_name))
0                            275

In [29]:
# First question, what countries are in the countiesNW table but are not considered node countries?

query = '''SELECT DISTINCT(countriesNW.country_name)
FROM countriesNW
LEFT JOIN node_countries
ON node_countries.country_name = countriesNW.country_name
WHERE node_countries.country_name IS NULL'''

sql_to_df(query)   # Expecting somewhere around 101 since 275-174 =101. Number of records is 107

# These are countries that are not node_countries

                                 country_name
0                                 Afghanistan
1                                    Akrotiri
2                                     Albania
3                              American Samoa
4                                  Antarctica
5                                       Aruba
6                 Ashmore and Cartier Islands
7                                Baker Island
8                             Bassas da India
9                                     Bolivia
10                              Bouvet Island
11             British Indian Ocean Territory
12                               Burkina Faso
13                                      Burma
14                                    Burundi
15                              CA te dIvoire
16                                   Cameroon
17                                 Cape Verde
18                   Central African Republic
19                                       Chad
20                           Christmas Island
21                          Clipperton Island
22                    Cocos (Keeling) Islands
23                                    Comoros
24                          Coral Sea Islands
25                                       Cuba
26                                    CuraAao
27                                   Dhekelia
28                          Equatorial Guinea
29                                    Eritrea
..                                        ...
77                               Saint Helena
78                  Saint Pierre and Miquelon
79                                 San Marino
80                      Sao Tome and Principe
81                                    Senegal
82                               Sint Maarten
83                            Solomon Islands
84                                    Somalia
85   South Georgia and South Sandwich Islands
86                                South Sudan
87                            Spratly Islands
88                                      Sudan
89                                   Svalbard
90                                  Swaziland
91                                Timor-Leste
92                                       Togo
93                                    Tokelau
94                            Tromelin Island
95                                    Tunisia
96                                     Tuvalu
97                          US Virgin Islands
98                                     Uganda
99                          Undersea Features
100                              Vatican City
101                               Wake Island
102                         Wallis and Futuna
103                                 West Bank
104                            Western Sahara
105                                     Yemen
106                                    Zambia

[107 rows x 1 columns]

In [31]:
## Check my SQL, expecting zero
query = '''SELECT Country_name
FROM node_countries
WHERE Country_name = 'Afghanistan' '''

sql_to_df(query) 

# In the actual database it states 0 rows returned in 396ms from:

Empty DataFrame
Columns: [country_name]
Index: []

In [32]:
### Explore the node countries more

query = '''SELECT *
FROM node_countries
LIMIT 5'''

sql_to_df(query)

   index  NODEID1 country_code country_name  country_id
0      0   118720           HK    Hong Kong       110.0
1      1   118722           HK    Hong Kong       110.0
2      2   118725           TW       Taiwan       241.0
3      3   118726           TW       Taiwan       241.0
4      4   118753           HK    Hong Kong       110.0

In [34]:
# How many times do each of the node countries show up
query = '''SELECT Country_name AS COUNTRY, COUNT(Country_name) AS Number_of_Appearances
FROM node_countries
GROUP BY Country_name
Limit 10'''

sql_to_df(query)

               COUNTRY  Number_of_Appearances
0              Algeria                      6
1              Andorra                     13
2               Angola                      2
3             Anguilla                     28
4  Antigua and Barbuda                    300
5            Argentina                     64
6              Armenia                     18
7            Australia                   1425
8              Austria                    123
9           Azerbaijan                     74

In [38]:
query = '''SELECT Country_name AS COUNTRY, COUNT(Country_name) AS Number_of_Appearances
FROM node_countries
GROUP BY Country_name
Having COUNT(Country_name) > 1000;
'''

sql_to_df(query)

                   COUNTRY  Number_of_Appearances
0                Australia                   1425
1   British Virgin Islands                  72677
2                   Canada                   1848
3           Cayman Islands                   3144
4                    China                  17776
5             Cook Islands                   1118
6                   Cyprus                   4718
7                Hong Kong                  40406
8                    India                   1180
9                Indonesia                   5404
10                 Ireland                   1719
11                   Japan                   1004
12                  Latvia                   1695
13                Malaysia                   3807
14          Not identified                  65912
15                  Panama                   2829
16                  Russia                  11734
17                   Samoa                   8778
18              Seychelles                   1157
19               Singapore                  10615
20                  Taiwan                  29327
21                Thailand                   1464
22    United Arab Emirates                   1305
23          United Kingdom                  10117
24           United States                  11490

In [42]:
# Within the SQLITE database this query works with 94 unique values in the subtypes column of the nodes table

#query = '''SELECT Distinct(subtypes_)
#FROM nodes;'''

#There is some special characters

#sql_to_df(query)

In [43]:
query = '''SELECT DISTINCT(desc_jurisdiction)
FROM nodes;'''

sql_to_df(query)

           desc_jurisdiction
0                       None
1                        BBC
2                    Bahamas
3                    Bermuda
4     British Virgin Islands
5                     Brunei
6                     Cayman
7                      China
8               Cook Islands
9                     Cyprus
10                     Dubai
11       Fund Administration
12                 Hong Kong
13                   Ireland
14                    Labuan
15                   Liberia
16                  Malaysia
17          Marshall Islands
18                 Mauritius
19               Netherlands
20                    Panama
21                       QQQ
22                      SAIC
23                     Samoa
24                Seychelles
25                 Singapore
26                 St. Lucia
27                  Thailand
28            United Kingdom
29  United States of America
30                   Vanuatu